kimanimichael/mk-hsm/ports/ESP32/ESP32_fsm.cpp
/**This program is a hierarchical state machines management framework.
Copyright (C) 2025  Michael Kimani

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.

In case of any enquiries, you can contact the author at muchunumike@gmail.com
**/
#include "bsp.h"
#include "ESP32_fsm.h"
#include "ESP32_bsp.h"
#include "esp_log.h"

#define QUEUE_LENGTH 10
#define MAX_TIME_EVENTS 10

#define TIMER_PERIOD_MS 100
constexpr TickType_t hsm_run_period{200};

static auto TAG = "esp_fsm";

static TimerHandle_t my_timer = xTimerCreate("MyTimer", pdMS_TO_TICKS(TIMER_PERIOD_MS), pdTRUE, nullptr, TimeEvent::tick);
bool my_timer_started = false;

void Active::_init(Active *object) {
    object->_start();
    xTaskCreate(event_loop, object->_task_name, object->_stack_size, object, object->_priority, nullptr);

    if (!my_timer_started && my_timer != nullptr) {
        xTimerStart(my_timer, 0);
        my_timer_started = true;
    }

    if (TimerHandle_t run_timer = xTimerCreate("HSM Run", pdMS_TO_TICKS(hsm_run_period), pdTRUE, object, run); run_timer != nullptr) {
        printf("Starting HSM Run timer for %s\n", object->_task_name);
        xTimerStart(run_timer, 0);
    }


}


Active::Active(const StateHandler& initial): HSM(initial) {
    printf("Active constructed\n");
}

void Active::_start() {
    _queue = xQueueCreate(QUEUE_LENGTH, sizeof(Event));
    assert(_queue != nullptr);
}

void Active::_post(Event const * const e) const {
    assert(_queue != nullptr);
    // printf("Posting to queue\n");
    xQueueSend(_queue, e, portMAX_DELAY);
}

void Active::event_loop(void* param) {
    const auto *self = static_cast<Active*>(param);
    self->_event_loop();
}


[[noreturn]] void Active::_event_loop() const {
    Event e = {};

    HSM::_init((Event*)nullptr);

    while (true) {
        // printf("Waiting for event...\n");
        if (xQueueReceive(_queue, &e, portMAX_DELAY)) {
            // printf("Event received...\n");
            HSM::_dispatch(&e);
        }
    }
}

void Active::run(TimerHandle_t xTimer) {
    const auto* self = static_cast<Active*>(pvTimerGetTimerID(xTimer));
    self -> _run();
}

void Active::_run() const {
    static constexpr Event hsm_run_sig = {HSM_RUN_SIG};
    _post(&hsm_run_sig);
}

TimeEvent * TimeEvent::time_event_instance = nullptr;

static TimeEvent *l_t_evt[MAX_TIME_EVENTS];
static uint_fast8_t l_t_evt_num = {};

SemaphoreHandle_t TimeEvent::_events_mutex = xSemaphoreCreateMutex();
SemaphoreHandle_t TimeEvent::_parameters_mutex = xSemaphoreCreateMutex();

TimeEvent::TimeEvent(const Signal sig, Active *act) : Event(), _act(act) {
    _sig = sig;
    if (xSemaphoreTake(TimeEvent::_events_mutex, portMAX_DELAY)) {
        l_t_evt[l_t_evt_num] = this;
        l_t_evt_num++;
    }
    xSemaphoreGive(TimeEvent::_events_mutex);
    time_event_instance = this;
}

void TimeEvent::_arm(const uint32_t timeout, const uint32_t interval) {
    if (xSemaphoreTake(TimeEvent::_parameters_mutex, portMAX_DELAY)) {
        _timeout = timeout;
        _interval = interval;
        printf("Armed successfully to %ld , %ld \n", _timeout, _interval);
    } else {
        ESP_LOGE(TAG, "Arming failed\n");
    }
    xSemaphoreGive(TimeEvent::_parameters_mutex);
}

void TimeEvent::_disarm() {
    if (xSemaphoreTake(TimeEvent::_parameters_mutex, portMAX_DELAY)) {
        _timeout = 0U;
        _interval = 0U;
        printf("Disarmed successfully\n");
    } else {
        ESP_LOGE(TAG, "Disarming failed\n");
    }
    xSemaphoreGive(TimeEvent::_parameters_mutex);
}

void TimeEvent::tick(TimerHandle_t xTimer) {
    time_event_instance->_tick();
}


void TimeEvent::_tick() const {
    for (uint_fast8_t i = 0; i < l_t_evt_num; i++) {
        // ESP_ERROR_CHECK(l_t_evt[i] != static_cast<TimeEvent*>(nullptr));
        if (l_t_evt[i] ->_timeout > 0U) {
            l_t_evt[i] ->_timeout --;
            if (l_t_evt[i] ->_timeout == 0U) {
                printf("Timeout reached. Posting\n");
                l_t_evt[i] ->_act->_post(this);
                l_t_evt[i] -> _timeout = l_t_evt[i]->_interval;
            }
        }
    }
}

TimeEvent* TimeEvent::get_default_instance(const Signal sig, Active *act) {
    static TimeEvent te(sig, act);
    return &te;
}


